; domain
(define (domain crystal-quest)
    (:requirements :strips :typing :negative-preconditions)

    (:types
        location character item - object
        hero - character
        crystal key - item
        warden - character
    )

    (:predicates
        (at ?char - character ?loc - location)
        (has ?char - character ?item - item)
        (defeated ?enemy - warden)
        (temple-accessible ?h - hero)
        (forest-spirit-helped)
        (connected ?from - location ?to - location)
        (forest-spirit-location ?loc - location)
        (dark-warden-location ?loc - location)
    )

    (:action travel
        :parameters (?h - hero ?from - location ?to - location)
        :precondition (and
            (at ?h ?from)
            (connected ?from ?to)
        )
        :effect (and
            (at ?h ?to)
            (not (at ?h ?from))
        )
    )

    (:action prove-worthiness-to-forest-spirit
        :parameters (?h - hero ?loc - location ?k - key)
        :precondition (and
            (at ?h ?loc)
            (forest-spirit-location ?loc)
            (not (has ?h ?k))
            (not (forest-spirit-helped))
        )
        :effect (and
            (has ?h ?k)
            (forest-spirit-helped)
        )
    )

    (:action travel-to-temple
        :parameters (?h - hero ?from - location ?to - location ?k - key)
        :precondition (and
            (at ?h ?from)
            (connected ?from ?to)
            (has ?h ?k)
            (forest-spirit-helped)
        )
        :effect (and
            (at ?h ?to)
            (not (at ?h ?from))
            (temple-accessible ?h)
        )
    )

    (:action enter-temple
        :parameters (?h - hero ?from - location ?to - location ?k - key)
        :precondition (and
            (at ?h ?from)
            (connected ?from ?to)
            (has ?h ?k)
            (temple-accessible ?h)
        )
        :effect (and
            (at ?h ?to)
            (not (at ?h ?from))
        )
    )

    (:action defeat-dark-warden
        :parameters (?h - hero ?loc - location ?w - warden ?c - crystal)
        :precondition (and
            (at ?h ?loc)
            (dark-warden-location ?loc)
            (not (defeated ?w))
        )
        :effect (and
            (defeated ?w)
            (has ?h ?c)
        )
    )
)

; problem
(define (problem crystal-quest-problem)
    (:domain crystal-quest)

    (:objects
        the-hero - hero
        Dawnmere Whispering-Forest Temple-of-Echoes-Outside Temple-of-Echoes-Inside - location
        magical-key - key
        crystal-of-light - crystal
        dark-warden - warden
    )

    (:init
        (at the-hero Dawnmere)
        (connected Dawnmere Whispering-Forest)
        (connected Whispering-Forest Dawnmere)
        (connected Whispering-Forest Temple-of-Echoes-Outside)
        (connected Temple-of-Echoes-Outside Whispering-Forest)
        (connected Temple-of-Echoes-Outside Temple-of-Echoes-Inside)
        (connected Temple-of-Echoes-Inside Temple-of-Echoes-Outside)
        (forest-spirit-location Whispering-Forest)
        (dark-warden-location Temple-of-Echoes-Inside)
    )

    (:goal
        (and
            (has the-hero crystal-of-light)
            (defeated dark-warden)
            (at the-hero Dawnmere)
            (temple-accessible the-hero)
            (has the-hero magical-key)
            (forest-spirit-helped)
        )
    )
)

; plan
1. (travel the-hero dawnmere whispering-forest)
   deleted: (at the-hero dawnmere)
   added: (at the-hero whispering-forest)
   goals met: 0 of 6
2. (prove-worthiness-to-forest-spirit the-hero whispering-forest magical-key)
   added: (has the-hero magical-key) (forest-spirit-helped)
   goals met: 2 of 6
3. (travel-to-temple the-hero whispering-forest temple-of-echoes-outside magical-key)
   deleted: (at the-hero whispering-forest)
   added: (at the-hero temple-of-echoes-outside) (temple-accessible the-hero)
   goals met: 3 of 6
4. (travel-to-temple the-hero temple-of-echoes-outside temple-of-echoes-inside magical-key)
   deleted: (at the-hero temple-of-echoes-outside)
   added: (at the-hero temple-of-echoes-inside)
   goals met: 3 of 6
5. (defeat-dark-warden the-hero temple-of-echoes-inside dark-warden crystal-of-light)
   added: (defeated dark-warden) (has the-hero crystal-of-light)
   goals met: 5 of 6
6. (travel-to-temple the-hero temple-of-echoes-inside temple-of-echoes-outside magical-key)
   deleted: (at the-hero temple-of-echoes-inside)
   added: (at the-hero temple-of-echoes-outside)
   goals met: 5 of 6
7. (travel-to-temple the-hero temple-of-echoes-outside whispering-forest magical-key)
   deleted: (at the-hero temple-of-echoes-outside)
   added: (at the-hero whispering-forest)
   goals met: 5 of 6
8. (travel-to-temple the-hero whispering-forest dawnmere magical-key)
   deleted: (at the-hero whispering-forest)
   added: (at the-hero dawnmere)
   goals met: 6 of 6
